# Relatório de Análise IV

## Seleções e frequências

In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv('dados/aluguel_residencial.csv', sep= ';')

In [3]:
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
5,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
6,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
7,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
8,Apartamento,Centro,1,0,0,36,1200.0,NaN,NaN
9,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0

In [7]:
# Selecione somente os imóveis classificados como 'tipo Apartamento';
apartamento = dados['Tipo']=='Apartamento'
n1 = dados[apartamento].shape[0]
n1

19532

In [6]:
# Selecione os imóveis classificados com tipo 'Casa', 'Casa de Condomínio' e "Casa de Vila";
casas = (dados['Tipo']=='Casa') | (dados['Tipo']=='Casa de Condomínio') | (dados['Tipo']=='Casa de Vila') 
n2 = dados[casas].shape[0]
n2

2212

In [8]:
# Selecione os imóveis com area entre '60 e 100 metros quadrados', incluindo os limites;
area = (dados['Area'] >= 60) & (dados['Area'] <= 100)
n3 = dados[area].shape[0]
n3

8719

In [9]:
# Selecione os imoveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00.
selecao = (dados['Quartos'] >= 4) & (dados['Valor'] < 2000)
n4 = dados[selecao].shape[0]
n4

41

In [10]:
print(f"Nº de imóveis classificados como 'tipo Apartamento' -> {n1}")
print(f"Nº de imóveis classificados com tipo 'Casa', 'Casa de Condomínio' e 'Casa de Vila' -> {n2}")
print(f"Nº de imóveis com area entre '60 e 100 metros quadrados', incluindo os limites -> {n3}")
print(f"Nº de imoveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00 -> {n4}")

Nº de imóveis classificados como 'tipo Apartamento' -> 19532
Nº de imóveis classificados com tipo 'Casa', 'Casa de Condomínio' e 'Casa de Vila' -> 2212
Nº de imóveis com area entre '60 e 100 metros quadrados', incluindo os limites -> 8719
Nº de imoveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00 -> 41

## Exercícios

In [11]:
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

### Selecão 1: Crie um DataFrame somente com os alunos aprovados

In [12]:
selecao = alunos['Aprovado'] == True
aprovados = alunos[selecao]
aprovados

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

### Seleção 2: Crie um DataFrame somente com as alunas aprovadas.

In [13]:
selecao = (alunos.Aprovado == True) & (alunos.Sexo == 'F')
aprovadas = alunos[selecao]
aprovadas

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

### Seleção 3: Crie apenas uma visualização dos alunos com idade entre 10 e 20 anos ou com idade maior ou igual a 40 anos.

In [16]:
selecao = ((alunos.Idade > 10) & 
    (alunos.Idade < 20)) | (alunos.Idade >= 40)
alunos[selecao]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False

## extra_aula 05 - outras formas de seleções

In [18]:
# criação de data frame, usando o metodo split() para criar index de linhas e colunas
data = [(1,2,3,4),
       (5,6,7,8),
       (9,10,11,12),
       (13,14,15,16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [19]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [20]:
df['c1'] # cria uma Series com o rotulo das colunas

l1     1
l2     5
l3     9
l4    13
Name: c1, dtype: int64

In [21]:
type(df['c1'])

pandas.core.series.Series

In [22]:
df[['c3', 'c1']] # cria um Dataframe com o as colunas

    c3  c1
l1   3   1
l2   7   5
l3  11   9
l4  15  13

In [23]:
type(df[['c3', 'c1']])

pandas.core.frame.DataFrame

In [24]:
df[1:3] # selecionando a partir do index default do DataFrame

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12

In [25]:
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   9
l4  15  13

In [27]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [26]:
df.loc['l3'] # loc = permite seleção atraves dos rotulos das linhas, criando uma Series com as colunas da linha

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [30]:
type(df.loc['l3'])

pandas.core.series.Series

In [28]:
df.loc[['l4', 'l1']] # criou um DataFrame

    c1  c2  c3  c4
l4  13  14  15  16
l1   1   2   3   4

In [29]:
type(df.loc[['l4', 'l1']])

pandas.core.frame.DataFrame

In [32]:
df.loc['l1', 'c3']

3

In [33]:
df.iloc[0,2] # o iloc usa os indices numericos default

3

In [35]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [34]:
df.loc[['l2', 'l4'], ['c1', 'c3']]

    c1  c3
l2   5   7
l4  13  15

In [36]:
df.iloc[[1, 3], [0, 2]]

    c1  c3
l2   5   7
l4  13  15

## Exercícios

### Seleção 4: Crie um DataFrame somente com os alunos reprovados e mantenha neste DataFrame apenas as colunas Nome, Sexo e Idade, nesta ordem.

In [40]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [37]:
selecao = alunos['Aprovado'] == False
reprovados = alunos.loc[selecao, ['Nome', 'Sexo', 'Idade']]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [38]:
selecao = alunos['Aprovado'] == False
reprovados = alunos[['Nome', 'Sexo', 'Idade']][selecao]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

### Seleção 5: Crie uma visualização com os três alunos mais novos

In [39]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [41]:
alunos.sort_values(by = ['Idade'], inplace = True)
alunos.iloc[:3]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True

Nesta aula, aprendemos:

Formas de seleção e frequências
Seleção com a condição OR (|)
Seleção com a condição AND (&)
Como criar um Index com split()
Seleção por linha e coluna em um dataframe:
Utilizando os índices numéricos e os rótulos das linhas